from .locators.index_locators import *

form_data = [[
    'Ваня',
    'Мишин',
    'улица кегельбанова, 84',
    0,
    '+799609876543',
    '5.03.2024',
    'ноу комент'],
    [
    'Михаил',
        'Витин',
        'улица Строителей, дом 12',
        1,
        '+79035678790',
        '5.04.2024',
        'побыстрее, ребенок спит'
]]

text_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
text_2 = (
    'Пока что у нас так: один заказ — один самокат. Если хотите' +
    ' покататься с друзьями, можете просто сделать несколько заказов' +
    ' — один за другим.')
text_3 = (
    'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая' +
    ' в течение дня. Отсчёт времени аренды начинается с момента, когда' +
    ' вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в' +
    ' 20:30, суточная аренда закончится 9 мая в 20:30.')
text_4 = (
    'Только начиная с завтрашнего дня. Но скоро станем расторопнее.')
text_5 = (
    'Пока что нет! Но если что-то срочное — всегда можно позвонить в' +
    ' поддержку по красивому номеру 1010.')
text_6 = (
    'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь' +
    ' суток — даже если будете кататься без передышек и во сне. Зарядка' +
    ' не понадобится.')
text_7 = (
    'Да, пока самокат не привезли. Штрафа не будет, объяснительной' +
    ' записки тоже не попросим. Все же свои.')
text_8 = (
    'Да, обязательно. Всем самокатов! И Москве, и Московской области.')


faq_test_data = (
    (question_1, answer_1, text_1),
    (question_2, answer_2, text_2),
    (question_3, answer_3, text_3),
    (question_4, answer_4, text_4),
    (question_5, answer_5, text_5),
    (question_6, answer_6, text_6),
    (question_7, answer_7, text_7),
    (question_8, answer_8, text_8),
)
